In [160]:
#Author:Prateek Kumar
#Welcome to Pandas Overview
#This notebook provides a quick overview of some of the functionalities of Pandas

In [161]:
##Creating an object in Pandas:
import pandas as pd 
import numpy as np
series = pd.Series([10,20,30,40,np.nan,50])
series

0    10.0
1    20.0
2    30.0
3    40.0
4     NaN
5    50.0
dtype: float64

In [162]:
##Creating a DataFrame by passing a NumPy array, with a datetime index and labeled columns:
#Creating the range:
dates = pd.date_range('20190101', periods=5)
dates
#Creating the dataframe:
df = pd.DataFrame(np.random.randn(5,5), index=dates, columns=list('ABCDE'))
df

                   A         B         C         D         E
2019-01-01  1.543488  0.757682  0.288509 -0.669882  0.710533
2019-01-02  0.005467  0.338386 -0.786438 -0.731138 -0.612662
2019-01-03 -0.141747 -1.202158 -1.171704  0.904324  0.788629
2019-01-04  0.789352  0.001673  0.143839  1.422935 -0.562781
2019-01-05  0.454946  0.401507  2.763610 -0.035004 -1.624416

In [163]:
##Creating a DataFrame by passing a dict of objects that can be converted to series-like.
df2 = pd.DataFrame({'A': pd.Series(1, range(4), dtype='float32'),
                   'B': pd.Timestamp('20190101'),
                   'C': 1.0,
                   'D': np.array([3]*4),
                   'E': pd.Categorical(["Test","Train","Test","Train"]),
                   'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2019-01-01  1.0  3   Test  foo
1  1.0 2019-01-01  1.0  3  Train  foo
2  1.0 2019-01-01  1.0  3   Test  foo
3  1.0 2019-01-01  1.0  3  Train  foo

In [164]:
##Datatypes we have in df2:
df2.dtypes

A           float32
B    datetime64[ns]
C           float64
D             int32
E          category
F            object
dtype: object

In [165]:
#Viewing data from Top:
df.head()

                   A         B         C         D         E
2019-01-01  1.543488  0.757682  0.288509 -0.669882  0.710533
2019-01-02  0.005467  0.338386 -0.786438 -0.731138 -0.612662
2019-01-03 -0.141747 -1.202158 -1.171704  0.904324  0.788629
2019-01-04  0.789352  0.001673  0.143839  1.422935 -0.562781
2019-01-05  0.454946  0.401507  2.763610 -0.035004 -1.624416

In [166]:
#Viewing from Bottom:
df.tail(3)

                   A         B         C         D         E
2019-01-03 -0.141747 -1.202158 -1.171704  0.904324  0.788629
2019-01-04  0.789352  0.001673  0.143839  1.422935 -0.562781
2019-01-05  0.454946  0.401507  2.763610 -0.035004 -1.624416

In [167]:
##Viewing Statistics about data:
df.describe()

              A         B         C         D         E
count  5.000000  5.000000  5.000000  5.000000  5.000000
mean   0.530301  0.059418  0.247563  0.178247 -0.260139
std    0.675728  0.754541  1.535123  0.957629  1.014795
min   -0.141747 -1.202158 -1.171704 -0.731138 -1.624416
25%    0.005467  0.001673 -0.786438 -0.669882 -0.612662
50%    0.454946  0.338386  0.143839 -0.035004 -0.562781
75%    0.789352  0.401507  0.288509  0.904324  0.710533
max    1.543488  0.757682  2.763610  1.422935  0.788629

In [168]:
##Transposing:
df.transpose()

   2019-01-01  2019-01-02  2019-01-03  2019-01-04  2019-01-05
A    1.543488    0.005467   -0.141747    0.789352    0.454946
B    0.757682    0.338386   -1.202158    0.001673    0.401507
C    0.288509   -0.786438   -1.171704    0.143839    2.763610
D   -0.669882   -0.731138    0.904324    1.422935   -0.035004
E    0.710533   -0.612662    0.788629   -0.562781   -1.624416

In [169]:
##Sorting by Axis:
df.sort_index(axis=1, ascending=True)

                   A         B         C         D         E
2019-01-01  1.543488  0.757682  0.288509 -0.669882  0.710533
2019-01-02  0.005467  0.338386 -0.786438 -0.731138 -0.612662
2019-01-03 -0.141747 -1.202158 -1.171704  0.904324  0.788629
2019-01-04  0.789352  0.001673  0.143839  1.422935 -0.562781
2019-01-05  0.454946  0.401507  2.763610 -0.035004 -1.624416

In [8]:
##Sorting by value:
df.sort_values(by=['A','C'])

                   A         B         C         D         E
2019-01-03 -1.915240 -0.002599  0.786445 -0.968133  1.214214
2019-01-04 -1.168033 -0.222363  0.075020  1.375685 -0.680730
2019-01-01 -0.862101 -0.402522  0.307144  0.109184  0.876944
2019-01-05 -0.615870  0.812414 -0.555517 -0.597560 -0.198525
2019-01-02 -0.522669 -0.532938  0.636924  0.436076  1.424425

In [170]:
##Getting:
df['A']

2019-01-01    1.543488
2019-01-02    0.005467
2019-01-03   -0.141747
2019-01-04    0.789352
2019-01-05    0.454946
Freq: D, Name: A, dtype: float64

In [171]:
##Selection:

In [172]:
##Selecting via [], which slices the rows:
df[0:3]

                   A         B         C         D         E
2019-01-01  1.543488  0.757682  0.288509 -0.669882  0.710533
2019-01-02  0.005467  0.338386 -0.786438 -0.731138 -0.612662
2019-01-03 -0.141747 -1.202158 -1.171704  0.904324  0.788629

In [173]:
##For getting a cross section using a label:
df.loc[dates[0]]

A    1.543488
B    0.757682
C    0.288509
D   -0.669882
E    0.710533
Name: 2019-01-01 00:00:00, dtype: float64

In [174]:
##Selecting on a multi-axis by label:
df.loc[:,['A','B']]

                   A         B
2019-01-01  1.543488  0.757682
2019-01-02  0.005467  0.338386
2019-01-03 -0.141747 -1.202158
2019-01-04  0.789352  0.001673
2019-01-05  0.454946  0.401507

In [175]:
##Reduction in the dimensions of the returned object:
df.loc['2019-01-03':,['A','B']]

                   A         B
2019-01-03 -0.141747 -1.202158
2019-01-04  0.789352  0.001673
2019-01-05  0.454946  0.401507

In [176]:
##Selection by Position:

In [177]:
#Select via the position of the passed integers:
df.iloc[2]

A   -0.141747
B   -1.202158
C   -1.171704
D    0.904324
E    0.788629
Name: 2019-01-03 00:00:00, dtype: float64

In [178]:
##Selection by integer slices:
df.iloc[2:4, 0:3]

                   A         B         C
2019-01-03 -0.141747 -1.202158 -1.171704
2019-01-04  0.789352  0.001673  0.143839

In [179]:
##Selection by lists of integer position locations:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2019-01-02  0.005467 -0.786438
2019-01-03 -0.141747 -1.171704
2019-01-05  0.454946  2.763610

In [180]:
##Boolean Indexing

In [181]:
##Using a single columnâ€™s values to select data:
df[df.A > 0]

                   A         B         C         D         E
2019-01-01  1.543488  0.757682  0.288509 -0.669882  0.710533
2019-01-02  0.005467  0.338386 -0.786438 -0.731138 -0.612662
2019-01-04  0.789352  0.001673  0.143839  1.422935 -0.562781
2019-01-05  0.454946  0.401507  2.763610 -0.035004 -1.624416

In [182]:
##Selecting values from a DataFrame where a boolean condition is met:
df[df > 0]

                   A         B         C         D         E
2019-01-01  1.543488  0.757682  0.288509       NaN  0.710533
2019-01-02  0.005467  0.338386       NaN       NaN       NaN
2019-01-03       NaN       NaN       NaN  0.904324  0.788629
2019-01-04  0.789352  0.001673  0.143839  1.422935       NaN
2019-01-05  0.454946  0.401507  2.763610       NaN       NaN

In [183]:
##Using the isin() method for filtering:
df3=df.copy()
df3['E']=['one','two','three','one','two']
df[df3['E'].isin(['one'])]

                   A         B         C         D         E
2019-01-01  1.543488  0.757682  0.288509 -0.669882  0.710533
2019-01-04  0.789352  0.001673  0.143839  1.422935 -0.562781

In [184]:
##Operations:

In [185]:
##Stats
df.mean()

A    0.530301
B    0.059418
C    0.247563
D    0.178247
E   -0.260139
dtype: float64

In [186]:
df.mean(1)

2019-01-01    0.526066
2019-01-02   -0.357277
2019-01-03   -0.164531
2019-01-04    0.359004
2019-01-05    0.392128
Freq: D, dtype: float64

In [187]:
df.apply(lambda x: x.max() - x.min())

A    1.685236
B    1.959840
C    3.935315
D    2.154073
E    2.413045
dtype: float64

In [188]:
df.apply(np.cumsum)

                   A         B         C         D         E
2019-01-01  1.543488  0.757682  0.288509 -0.669882  0.710533
2019-01-02  1.548955  1.096069 -0.497929 -1.401019  0.097871
2019-01-03  1.407208 -0.106089 -1.669633 -0.496695  0.886500
2019-01-04  2.196560 -0.104416 -1.525794  0.926240  0.323719
2019-01-05  2.651505  0.297090  1.237816  0.891236 -1.300697

In [ ]:
##Strings:

In [189]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [190]:
##Concat
pieces = [df[:3], df[3:5], df[4:]]
pd.concat(pieces)

                   A         B         C         D         E
2019-01-01  1.543488  0.757682  0.288509 -0.669882  0.710533
2019-01-02  0.005467  0.338386 -0.786438 -0.731138 -0.612662
2019-01-03 -0.141747 -1.202158 -1.171704  0.904324  0.788629
2019-01-04  0.789352  0.001673  0.143839  1.422935 -0.562781
2019-01-05  0.454946  0.401507  2.763610 -0.035004 -1.624416
2019-01-05  0.454946  0.401507  2.763610 -0.035004 -1.624416

In [191]:
##Join
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
pd.merge(left,right,on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [192]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
pd.merge(left,right,on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [193]:
##Append
s=df.iloc[3]
df.append(s, ignore_index=True)

          A         B         C         D         E
0  1.543488  0.757682  0.288509 -0.669882  0.710533
1  0.005467  0.338386 -0.786438 -0.731138 -0.612662
2 -0.141747 -1.202158 -1.171704  0.904324  0.788629
3  0.789352  0.001673  0.143839  1.422935 -0.562781
4  0.454946  0.401507  2.763610 -0.035004 -1.624416
5  0.789352  0.001673  0.143839  1.422935 -0.562781

In [194]:
df5 = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
                   'B': ['one', 'one', 'two', 'three','two', 'two', 'one', 'three'],
                   'C': np.random.randn(8),
                   'D': np.random.randn(8)})
df5

     A      B         C         D
0  foo    one -0.147964  1.058442
1  bar    one  0.395343  0.014675
2  foo    two  0.431364  1.742238
3  bar  three  0.900862 -0.207596
4  foo    two  0.735417  0.608061
5  bar    two  0.939850 -0.021899
6  foo    one -0.123111  0.209652
7  foo  three -3.261475 -2.147473

In [195]:
##Grouping

In [196]:
df5.groupby('A').sum()

            C        D
A
bar  2.236055 -0.21482
foo -2.365770  1.47092

In [197]:
df5.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one    0.395343  0.014675
    three  0.900862 -0.207596
    two    0.939850 -0.021899
foo one   -0.271075  1.268094
    three -3.261475 -2.147473
    two    1.166781  2.350299

In [198]:
##Pivot Tables
pd.pivot_table(df5, values='D', index=['A'], columns=['B'])

B         one     three       two
A
bar  0.014675 -0.207596 -0.021899
foo  0.634047 -2.147473  1.175150

In [199]:
##Getting Data In/Out

In [200]:
##CSV
##Writing to csv:
#df.to_csv('foo.csv')
##Reading from csv:
#pd.read_csv('foo.csv')

In [201]:
##Excel:
##Writing to excel:
#df.to_excel('foo.xlsx', sheet_name='Sheet1')
##Reading from excel:
#pd.read_excel('foo.xlsx', 'Sheet1', index_col=None, na_values=['NA'])